app/Controllers/ProductController.php

    public function index()
    {
        $data['items'] = $this->products->findAll();
---
SELECT *
FROM `products`