app/Controllers/SignupController.php

    public function store(){
        $rules = [
            'name'          => 'required|min_length[2]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
            'password'      => 'required|min_length[4]|max_length[50]',
            // 'confirmpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $data =[
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                'password' => $this->request->getVar('password'),
            ];
            $userModel = new UserModel();
            $userModel->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Nadia', 'nadia@gmail.com', 'admin123')